function WhatsAppFloat() {
  return (
    <a
      href="https://wa.me/201034022992"
      target="_blank"
      rel="noopener noreferrer"
      className="fixed bottom-6 left-6 flex items-center gap-2 bg-green-500 hover:bg-green-600 text-white px-5 py-3 rounded-full shadow-xl transition duration-300 hover:scale-110"
    >

      {/* أيقونة واتساب */}

      <svg
        xmlns="http://www.w3.org/2000/svg"
        viewBox="0 0 32 32"
        width="24"
        height="24"
        fill="white"
      >
        <path d="M16 .4C7.3.4.3 7.4.3 16c0 2.8.7 5.4 2.1 7.7L.2 31.8l8.4-2.2c2.2 1.2 4.7 1.9 7.4 1.9 8.7 0 15.7-7 15.7-15.6S24.7.4 16 .4zm0 28.5c-2.4 0-4.7-.6-6.8-1.7l-.5-.3-5 1.3 1.3-4.8-.3-.5C3.7 20.7 3 18.4 3 16 3 9.3 9.3 3 16 3s13 6.3 13 13-6.3 12.9-13 12.9zm7.2-9.7c-.4-.2-2.2-1.1-2.6-1.2-.3-.1-.6-.2-.9.2s-1 1.2-1.2 1.5c-.2.3-.4.3-.8.1-.4-.2-1.6-.6-3-1.9-1.1-1-1.9-2.2-2.1-2.6-.2-.3 0-.5.2-.7.2-.2.4-.5.6-.7.2-.2.3-.4.4-.6.1-.2.1-.4 0-.6-.1-.2-.9-2.3-1.3-3.1-.3-.8-.7-.7-.9-.7h-.8c-.3 0-.6.1-.9.4-.3.3-1.2 1.1-1.2 2.7s1.2 3.2 1.4 3.4c.2.2 2.3 3.6 5.6 5 .8.4 1.5.6 2 .7.8.2 1.6.2 2.2.1.7-.1 2.2-.9 2.5-1.8.3-.9.3-1.6.2-1.8-.1-.2-.3-.3-.7-.5z"/>
      </svg>

      {/* النص */}

      للتواصل

    </a>
  )
}

export default WhatsAppFloat